ftoralesacosta/esp32-Matter-Over-Thread/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Enable OpenThread and Optimize Reliability (Full Thread Device Router)
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_FTD=n
CONFIG_OPENTHREAD_MTD=y
CONFIG_OPENTHREAD_RADIO=n
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=y
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=100
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n


# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Waveshare ESP32-H2-Zero has 4MB flash. Same footgun as esp32c6: this was
# only ever set in a stale committed sdkconfig, never in any defaults file,
# so a clean build reverts to IDF's 2MB default and breaks the partition
# table (partitions.csv sizes to ~3.9MB). See sdkconfig.defaults.esp32c6 for
# the original diagnosis.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# CHIP's crypto layer calls mbedtls_hkdf directly; mbedtls only builds it in
# if HKDF_C is enabled. Same story as flash size above - missing here would
# break the final link step with "undefined reference to `mbedtls_hkdf'".
CONFIG_MBEDTLS_HKDF_C=y

# CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY defaults to y on any chip with
# SOC_ECDSA_SUPPORTED, which includes the H2. During the first-ever real H2
# commissioning attempt (on the feature/led-mosfet-control branch), the
# device hard-hung (task watchdog, IDLE task starved) inside
# ecdsa_hal_verify_signature while verifying the trusted root certificate
# (AddTrustedRootCertificate) - stuck in ecdsa_ll_get_state/ecdsa_ll_set_stage
# and never returning. This looks like a bug in this ESP-IDF version's H2
# ECDSA hardware-peripheral driver, not anything in our own code. Falling
# back to mbedTLS's software ECDSA verification avoids the hardware path
# entirely; verification only happens during commissioning, so the
# performance cost doesn't matter. See .agents/FINDINGS.md Section -2 for
# the full diagnosis.
CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY=n

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# Disable STA and AP for ESP32H2
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# This branch (feature/fan_with_dial) exists to build and test rotary
# encoder support, so it defaults to enabled here. The Kconfig option itself
# defaults to n (see main/Kconfig.projbuild), so a build on main or any
# other branch without this line stays dial-free.
CONFIG_ENABLE_ROTARY_ENCODER=y

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=y

# Enable DS Peripheral
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=y

# Disable persist subscriptions
CONFIG_ENABLE_PERSIST_SUBSCRIPTIONS=n

# MRP configs
CONFIG_MRP_LOCAL_ACTIVE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_LOCAL_IDLE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_RETRY_INTERVAL_SENDER_BOOST_FOR_THREAD=5000
CONFIG_MRP_MAX_RETRANS=3

# ESP32-H2-DevKitM-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
